docs/how-to-guide.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-02 Fri 15:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>How-to Software Guide (CWI CI Group)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jan-Willem Buurlage, Allard Hendriksen">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">How-to Software Guide (CWI CI Group)</h1>

<div id="outline-container-org2106da7" class="outline-2">
<h2 id="org2106da7"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Introduction</h2>
</div>
<div id="outline-container-orgd280b5a" class="outline-2">
<h2 id="orgd280b5a"><span class="section-number-2">2</span> How-to</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf4df8b6" class="outline-3">
<h3 id="orgf4df8b6"><span class="section-number-3">2.1</span> Python</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org35cef51" class="outline-4">
<h4 id="org35cef51"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> Auto-format your code</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<div id="outline-container-org6a57775" class="outline-5">
<h5 id="org6a57775"><span class="section-number-5">2.1.1.1</span> PEP8</h5>
</div>
<div id="outline-container-org101ec13" class="outline-5">
<h5 id="org101ec13"><span class="section-number-5">2.1.1.2</span> <a href="https://github.com/google/yapf">yapf</a></h5>
</div>
</div>
</div>
<div id="outline-container-orgc2b00c1" class="outline-3">
<h3 id="orgc2b00c1"><span class="section-number-3">2.2</span> C++</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org85f92d0" class="outline-4">
<h4 id="org85f92d0"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> Auto-format your code</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<div id="outline-container-org8967b93" class="outline-5">
<h5 id="org8967b93"><span class="section-number-5">2.2.1.1</span> <code>clang-format</code></h5>
</div>
</div>
<div id="outline-container-org0331c85" class="outline-4">
<h4 id="org0331c85"><span class="section-number-4">2.2.2</span> <span class="todo TODO">TODO</span> Use CMake to build your software</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<div id="outline-container-orgfc2a0ae" class="outline-5">
<h5 id="orgfc2a0ae"><span class="section-number-5">2.2.2.1</span> C++ Weekly, <a href="https://www.youtube.com/watch?v=HPMvU64RUTY">Intro to CMake</a></h5>
</div>
<div id="outline-container-orgeca5e63" class="outline-5">
<h5 id="orgeca5e63"><span class="section-number-5">2.2.2.2</span> <a href="https://llvm.org/docs/CMakePrimer.html">CMakePrimer (LLVM)</a></h5>
</div>
<div id="outline-container-org99569d7" class="outline-5">
<h5 id="org99569d7"><span class="section-number-5">2.2.2.3</span> <a href="https://www.youtube.com/watch?v=eC9-iRN2b04">CppCon 2017: Mathieu Ropert “Using Modern CMake Patterns to Enforce a Good Modular Design”</a></h5>
</div>
<div id="outline-container-org8cb70db" class="outline-5">
<h5 id="org8cb70db"><span class="section-number-5">2.2.2.4</span> <a href="https://www.youtube.com/watch?v=bsXLMQ6WgIk">C++Now 2017: Daniel Pfeifer “Effective CMake"</a></h5>
</div>
<div id="outline-container-org5586e12" class="outline-5">
<h5 id="org5586e12"><span class="section-number-5">2.2.2.5</span> <a href="https://foonathan.net/blog/2016/07/07/cmake-dependency-handling.html">Dependency management CMake/Git</a></h5>
<div class="outline-text-5" id="text-2-2-2-5">
<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #bc6ec5; font-weight: bold;">find_package</span><span style="color: #4f97d7;">(</span>ZeroMQ QUIET<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>ZeroMQ_FOUND<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">add_library</span><span style="color: #4f97d7;">(</span>zmq INTERFACE<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">target_include_directories</span><span style="color: #4f97d7;">(</span>zmq INTERFACE $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">ZeroMQ_INCLUDE_DIR</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">target_link_libraries</span><span style="color: #4f97d7;">(</span>zmq INTERFACE $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">ZeroMQ_LIBRARY</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">else</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">message</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"'zmq' not installed on the system, building from source..."</span><span style="color: #4f97d7;">)</span>

    <span style="color: #bc6ec5; font-weight: bold;">execute_process</span><span style="color: #4f97d7;">(</span>COMMAND git submodule update --init --remote -- ext/libzmq
        WORKING_DIRECTORY $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">CMAKE_SOURCE_DIR</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

    <span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>ZMQ_BUILD_TESTS OFF CACHE BOOL <span style="color: #2d9574;">"disable tests"</span> FORCE<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>WITH_PERF_TOOL OFF CACHE BOOL <span style="color: #2d9574;">"disable perf-tools"</span> FORCE<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">add_subdirectory</span><span style="color: #4f97d7;">(</span>$<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">CMAKE_SOURCE_DIR</span><span style="color: #bc6ec5;">}</span>/ext/libzmq<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>ZMQ_INCLUDE_DIR $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">CMAKE_SOURCE_DIR</span><span style="color: #bc6ec5;">}</span>/ext/libzmq/include<span style="color: #4f97d7;">)</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># ZeroMQ names their target libzmq, which is inconsistent =&gt; create a ghost dependency</span>
    <span style="color: #bc6ec5; font-weight: bold;">add_library</span><span style="color: #4f97d7;">(</span>zmq INTERFACE<span style="color: #4f97d7;">)</span>
    <span style="color: #bc6ec5; font-weight: bold;">target_link_libraries</span><span style="color: #4f97d7;">(</span>zmq INTERFACE libzmq<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">endif</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge403745" class="outline-5">
<h5 id="orge403745"><span class="section-number-5">2.2.2.6</span> <a href="https://foonathan.net/blog/2018/10/17/cmake-warnings.html">https://foonathan.net/blog/2018/10/17/cmake-warnings.html</a></h5>
</div>
</div>
<div id="outline-container-org8312e65" class="outline-4">
<h4 id="org8312e65"><span class="section-number-4">2.2.3</span> <span class="todo TODO">TODO</span> Use a good set of compile commands</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<div id="outline-container-orga926fb4" class="outline-5">
<h5 id="orga926fb4"><span class="section-number-5">2.2.3.1</span> Sensible compile flags</h5>
<div class="outline-text-5" id="text-2-2-3-1">
</div>
<ol class="org-ol">
<li><a id="orgf9bf269"></a><code>-Wall</code><br></li>
<li><a id="orgd0379cc"></a><code>-Werror</code><br></li>
<li><a id="orgdc51b38"></a><code>-Wfatal</code><br></li>
<li><a id="orgb8ac93c"></a>&#x2026;<br></li>
</ol>
</div>
</div>
<div id="outline-container-orga3685f2" class="outline-4">
<h4 id="orga3685f2"><span class="section-number-4">2.2.4</span> <span class="todo TODO">TODO</span> Manage dynamic dependencies</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Three places that a binary looks for shared dependencies
</p>
<ol class="org-ol">
<li><code>LD_LIBRARY_PATH</code></li>
<li><code>rpath</code> encoded in binary</li>
<li>system default paths</li>
</ol>

<p>
Danger of (1) is that it overrides the specific dependencies of all binaries run.
</p>

<p>
For shared systems, or non-root users, (3) can be a problem.
</p>

<p>
For 2 you proceed as follows:
</p>
<ul class="org-ul">
<li>set <code>LD_RUN_PATH</code> to something hardcoded</li>
<li>use <code>-R</code> in gcc</li>
</ul>

<p>
To check the <code>RPATH</code> in a binary on Linux, use <code>readelf -d &lt;binary&gt;</code>.
</p>

<p>
To list all dynamic dependencies, use <code>ldd &lt;binary&gt;</code>
</p>

<p>
See also: <a href="https://www.eyrie.org/~eagle/notes/rpath.html">https://www.eyrie.org/~eagle/notes/rpath.html</a>.
</p>
</div>
</div>
<div id="outline-container-org03c0ffe" class="outline-4">
<h4 id="org03c0ffe"><span class="section-number-4">2.2.5</span> Create Python bindings using <code>pybind11</code></h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Adding Python bindings to C++ code is straightforward with pybind11. A good
setup is as follows. (All relative to the root folder of the C++ project, which
I call <code>your_project</code> here)
</p>
</div>
<div id="outline-container-orga626a93" class="outline-5">
<h5 id="orga626a93"><span class="section-number-5">2.2.5.1</span> Add pybind11 as a git submodule</h5>
<div class="outline-text-5" id="text-2-2-5-1">
<div class="org-src-container">
<pre class="src src-bash">git submodule add https://github.com/pybind/pybind11.git ext/pybind11
</pre>
</div>
</div>
</div>
<div id="outline-container-org32b164c" class="outline-5">
<h5 id="org32b164c"><span class="section-number-5">2.2.5.2</span> Set up the Python bindings</h5>
<div class="outline-text-5" id="text-2-2-5-2">
<p>
Make a directory <code>python</code>, containing at least three files:
</p>
</div>
<ol class="org-ol">
<li><a id="org0dee7df"></a><code>python/src/module.cpp</code><br>
<div class="outline-text-6" id="text-2-2-5-2-1">
<p>
This contains the actual bindings, an example is like this:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">pybind11/pybind11.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">py</span> = pybind11;

<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"your_project/your_project.hpp"</span>

<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">your_project</span>;

<span style="color: #bc6ec5; font-weight: bold;">PYBIND11_MODULE</span><span style="color: #4f97d7;">(</span>py_your_project, m<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    m.doc<span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5;">)</span> = <span style="color: #2d9574;">"bindings for your_project"</span>;

    <span style="color: #a45bad;">py</span>::class_<span style="color: #bc6ec5;">&lt;</span><span style="color: #a45bad;">your_project</span>::object<span style="color: #bc6ec5;">&gt;</span><span style="color: #bc6ec5;">(</span>m, <span style="color: #2d9574;">"object"</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org48ce9d2"></a><code>python/your_project/__init__.py</code><br>
<div class="outline-text-6" id="text-2-2-5-2-2">
<p>
The entry point for the Python specific code of your project. Also reexports
symbols from the generated bindings.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> py_your_project <span style="color: #4f97d7; font-weight: bold;">import</span> *
</pre>
</div>
</div>
</li>
<li><a id="orga91aa58"></a><code>python/CMakeLists.txt</code><br>
<div class="outline-text-6" id="text-2-2-5-2-3">
<p>
You can build the bindings using CMake.
</p>
<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>BINDING_NAME <span style="color: #2d9574;">"py_your_project"</span><span style="color: #4f97d7;">)</span>
<span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>BINDING_SOURCES <span style="color: #2d9574;">"src/module.cpp"</span><span style="color: #4f97d7;">)</span>

<span style="color: #bc6ec5; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>CMAKE_LIBRARY_OUTPUT_DIRECTORY <span style="color: #2d9574;">"${</span><span style="color: #7590db;">CMAKE_CURRENT_SOURCE_DIR</span><span style="color: #2d9574;">}"</span><span style="color: #4f97d7;">)</span>

<span style="color: #bc6ec5; font-weight: bold;">pybind11_add_module</span><span style="color: #4f97d7;">(</span>$<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">BINDING_NAME</span><span style="color: #bc6ec5;">}</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">BINDING_SOURCES</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

<span style="color: #bc6ec5; font-weight: bold;">target_link_libraries</span><span style="color: #4f97d7;">(</span>$<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">BINDING_NAME</span><span style="color: #bc6ec5;">}</span> PRIVATE your_project<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc582723" class="outline-5">
<h5 id="orgc582723"><span class="section-number-5">2.2.5.3</span> Add it as a subdirectory</h5>
<div class="outline-text-5" id="text-2-2-5-3">
<p>
In the main <code>CMakeLists.txt</code> of your project, add the Python folder:
</p>
<div class="org-src-container">
<pre class="src src-cmake">...
<span style="color: #bc6ec5; font-weight: bold;">add_subdirectory</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"ext/pybind11"</span><span style="color: #4f97d7;">)</span>
<span style="color: #bc6ec5; font-weight: bold;">add_subdirectory</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"python"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Now, the python bindings will be built alongside your project.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb855bf0" class="outline-3">
<h3 id="orgb855bf0"><span class="section-number-3">2.3</span> General</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org391a3c8" class="outline-4">
<h4 id="org391a3c8"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> Write good documentation</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li><a href="http://stevelosh.com/blog/2013/09/teach-dont-tell/">http://stevelosh.com/blog/2013/09/teach-dont-tell/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org98d7514" class="outline-4">
<h4 id="org98d7514"><span class="section-number-4">2.3.2</span> <span class="todo TODO">TODO</span> Write good commit messages</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li><a href="http://chris.beams.io/posts/git-commit/">http://chris.beams.io/posts/git-commit/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3d2a738" class="outline-4">
<h4 id="org3d2a738"><span class="section-number-4">2.3.3</span> <span class="todo TODO">TODO</span> Write a good readme</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
<a href="https://github.com/LappleApple/feedmereadmes/blob/master/README-maturity-model.md">This github repo</a> contains a useful model of maturity levels for a
project's README.md file. It defines both the current level of
maturity of a README and gives pointers on how to improve.
</p>
</div>
</div>
<div id="outline-container-org9d0b85d" class="outline-4">
<h4 id="org9d0b85d"><span class="section-number-4">2.3.4</span> <span class="todo TODO">TODO</span> Set up your Git branches</h4>
<div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
<li><b>Branching model</b>: <a href="http://nvie.com/posts/a-successful-git-branching-model/">http://nvie.com/posts/a-successful-git-branching-model/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1cd10e5" class="outline-4">
<h4 id="org1cd10e5"><span class="section-number-4">2.3.5</span> <span class="todo TODO">TODO</span> Use module systems</h4>
</div>
<div id="outline-container-orgfcf26a3" class="outline-4">
<h4 id="orgfcf26a3"><span class="section-number-4">2.3.6</span> <span class="todo TODO">TODO</span> Set up travis CI</h4>
<div class="outline-text-4" id="text-2-3-6">
</div>
<div id="outline-container-org6cf0964" class="outline-5">
<h5 id="org6cf0964"><span class="section-number-5">2.3.6.1</span> C++17</h5>
</div>
<div id="outline-container-org6dfc87d" class="outline-5">
<h5 id="org6dfc87d"><span class="section-number-5">2.3.6.2</span> travis.yml / Makefile</h5>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
